Repository: codehelp/pybit-debian
Catalog: debian/po/*.po
Languages: cs

source: PyBit client-ID string:
cs: Identifikační řetězec PyBit klienta:

source: Please specify a unique string that can be used to identify this client within the job list and queues.
cs: Zadejte prosím unikátní řetězec, který se bude používat k identifikaci tohoto klienta v seznamu úloh a ve frontách.

source: Use LVM snapshots on this client?
cs: Používat u tohoto klienta LVM snapshoty?

source: If the sbuild configuration uses LVM snapshots, pybit-client can ensure that your snapshot APT cache data is kept up-to-date whilst keeping the snapshot clean.
cs: Pokud nastavení sbuild používá LVM snapshoty, pybit-client může zajistit, aby snapshoty dat z APT cache zůstaly aktuální a zároveň je udrží pročištěné.

source: Buildd location:
cs: Umístění pro buildd:

source: Please specify a writeable directory where the version control handler and the upload task can write files.
cs: Zadejte prosím zapisovatelný adresář, kam může správce verzí a úloha nahrávání ukládat soubory.

source: If this is left blank, the default /home/buildd/pybit will be used.
cs: Ponecháte-li políčko prázdné, použije se výchozí umístění /home/buildd/pybit.

source: Host machine running RabbitMQ:
cs: Hostitelský server, na kterém běží RabbitMQ:

source: Please specify the server running RabbitMQ that this buildd client will communicate with, receiving details of the jobs it needs to attempt to build.
cs: Zadejte prosím server, na kterém běží RabbitMQ, se kterým bude tento buildd komunikovat, získávat údaje o úlohách, ty potřebuje při požadavcích na sestavení.

source: Destination for dput package uploads:
cs: Cíl nahrávání balíčků pro dput:

source: Please specify the machine that this client will use as upload host. This destination will be stored in its dput configuration.
cs: Zadejte prosím server, který bude tento klient používat jako hostitele pro nahrávání. Tento cíl se u klienta uloží do nastavení dput.

source: This entry must not be empty.
cs: Toto políčko nemůže být prázdné.

source: Client-ID string cannot be empty!
cs: Identifikační řetězec klienta nemůže být prázdný!

source: This client will fail to start until it receives a unique client-ID.
cs: Dokud nebude mít klient unikátní ID, nebude jej možné spustit.

source: Missing RabbitMQ hostname!
cs: Chybí název hostitele RabbitMQ serveru!

source: This client will not receive any messages from the queue and will not build any packages until a RabbitMQ host is specified.
cs: Klient nebude dostávat žádné zprávy z fronty a nebude sestavovat žádné balíčky, dokud nebude zadán hostitel RabbitMQ serveru.

source: Please edit /etc/pybit/client/client.conf after configuration.
cs: Po dokončení nastavování upravte prosím soubor /etc/pybit/client/client.conf.

source: Missing dput destination!
cs: Chybí cíl pro dput!

source: pybit-client is not intended to upload to unspecified dput destinations like ftp-master.debian.org and does not currently support GnuPG signed uploads.
cs: pybit-client nebyl vytvořen k nahrávání na neurčené dput cíle, jako je ftp-master.debian.org a v současné době nepodporuje nahrávání podepsaná GnuPG klíči.

source: Please specify the server running RabbitMQ with which the web front-end and the pyBit controller need to communicate, sending the details of the jobs to be built.
cs: Zadejte prosím server, na kterém běží RabbitMQ, se kterým potřebuje komunikovat webové rozhraní a pyBit řadič a který bude odesílat údaje o úlohách, které se mají sestavovat.

source: Fully qualified hostname for the web front-end:
cs: Plně kvalifikovaný název hostitele pro webové rozhraní:

source: Please specify the host running the web front-end (which will also be running the pyBit controller).
cs: Zadejte prosím název hostitele, na kterém běží webové rozhraní (na kterém bude také běžet pyBit řadič).

source: You may choose to use a named Apache virtual host or accept the default if all the pyBit clients also run on this one machine.
cs: Můžete se rozhodnout používat jmenného virtuálního hosta Apache, nebo přijmout výchozí nastavení, pokud všichni pyBit klienti běží také na tomto jednom serveru.

source: The hostname is passed down to the build clients to allow them to post failure messages back to the controller.
cs: Název hostitele je předáván build klientům, to jim umožňuje odesílat zpět řadiči hlášení o selhání.

source: Port for web front-end:
cs: Port pro webové rozhraní:

source: Please specify the port that the web front-end should be available on. If it is serving localhost, it is probably easiest to use port 8080.
cs: Zadejte prosím port, na kterém má být dostupné webové rozhraní. Pokud je obsluhováno z místního serveru, je pravděpodobně nejsnazší použít port 8080.

source: If the web front-end is running on a dedicated host or an Apache virtual host, it may be preferable to use port 80.
cs: Pokud webové rozhraní běží na odděleném serveru, nebo na virtuálním hostu Apache, může být vhodnější použít port 80.

source: If no RabbitMQ host is specified for the pyBit controller, the build clients will not receive any messages on the queue or build any packages.
cs: Pokud nemá pyBit řadič zadán žádného hostitele RabbitMQ serveru, build klienti neobdrží žádné zprávy ve frontě a nebudou sestavovat žádné balíčky.

source: Please edit /etc/pybit/web/web.conf after configuration.
cs: Po dokončení nastavování upravte prosím soubor /etc/pybit/web/web.conf.
